Revit 2024 API
LinkedResourceOpenedEventArgs.ResourceTypeId Property
 Element id of the linked resource.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public ElementId ResourceTypeId { get; }
Visual Basic
Public ReadOnly Property ResourceTypeId As ElementId
	Get
Visual C++
public:
property ElementId^ ResourceTypeId {
	ElementId^ get ();
}
See Also
LinkedResourceOpenedEventArgs Class
Autodesk.Revit.DB.Events Namespace